foamCases/monopoleFlow/quadMesh/teste2/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1812                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1812;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298.15;

boundaryField
{
    frontAndBack 
    {
        type            empty;
    }
    
//    "(top|bottom|left|right)"
    outer
    {
/*
        type            freestream;
        freestreamValue $internalField;
        value           $internalField;
*/
        type            waveTransmissive;
        field           T;
        phi             phi;
        rho             rho;
        psi             thermo:psi;
        gamma           1.4;
        value           $internalField;
    }
}

// ************************************************************************* //
